/* Option argument types */
"OPTION_TYPE_STRING" = "string";
"OPTION_TYPE_NUMBER" = "number";
"OPTION_TYPE_VALUE" = "value";

/* Global Options */
"GLOBAL_OPTION_CLOSE" = "Enables the close titlebar button.";
"GLOBAL_OPTION_DEBUG" = "Enables verbose output for debugging possible issues with provided options.";
"GLOBAL_OPTION_HELP" = "Displays this help.";
"GLOBAL_OPTION_HEIGHT" = "Height of the control.";
"GLOBAL_OPTION_ICON" = "Name of the icon to use. See website for full list.";
"GLOBAL_OPTION_ICON_BUNDLE" = "Name of the bundle to load icon from.";
"GLOBAL_OPTION_ICON_FILE" = "Filename of an icon or image to use.";
"GLOBAL_OPTION_ICON_HEIGHT" = "Height of the icon.";
"GLOBAL_OPTION_ICON_SIZE" = "Unified height and width of icon. Can be one of: 16, 32, 48, 128, 256.";
"GLOBAL_OPTION_ICON_TYPE" = "File extension type to use. Defaults to \"icns\"";
"GLOBAL_OPTION_ICON_WIDTH" = "Width of the icon.";
"GLOBAL_OPTION_MAX_HEIGHT" = "Maximum height for the control.";
"GLOBAL_OPTION_MAX_WIDTH" = "Maximum width for the control.";
"GLOBAL_OPTION_MIN_HEIGHT" = "Minimum height for the control.";
"GLOBAL_OPTION_MIN_WIDTH" = "Minimum width for the control.";
"GLOBAL_OPTION_MINIMIZE" = "Enables the minimize titlebar button.";
"GLOBAL_OPTION_NO_FLOAT" = "Prevents the control from always showing. WARNING: disabling this may cause the control to become difficult to manage.";
"GLOBAL_OPTION_NO_NEWLINE" = "Disables printing a newline character after the control has returned any input and closed.";
"GLOBAL_OPTION_POSX" = "The horizontal position of the control. Possible values are: \"left\", \"center\", \"right\" or a <number> in pixels.";
"GLOBAL_OPTION_POSY" = "The vertical position of the control. Possible values are: \"top\", \"center\", \"bottom\" or a <number> in pixels.";
"GLOBAL_OPTION_QUIET" = "Silences all output.";
"GLOBAL_OPTION_RESIZE" = "Enables the zoom titlebar button and allows the control to be resizeable.";
"GLOBAL_OPTION_SCREEN" = "Indicates on which screen the control will appear. By default, the screen that currently has keyboard focus is chosen.";
"GLOBAL_OPTION_STRING_OUTPUT" = "Returns text values of input elements rather than their numerical index.";
"GLOBAL_OPTION_TITLE" = "Label to use in the titlebar of the control.";
"GLOBAL_OPTION_TIMEOUT" = "Number of seconds the control should wait for user input before timing out.";
"GLOBAL_OPTION_TIMEOUT_FORMAT" = "Sets the timeout format used to display the remaining time. Provided replacement tokens include: %r (relative), %d (day), %h (hour), %m (minute) and %s (second).";
"GLOBAL_OPTION_WIDTH" = "Width of the control.";

/* General */
"CANCEL" = "Cancel";
"NO" = "No";
"OK" = "Ok";
"OKAY" = "Okay";
"OPTION_EMPTY_TEXT" = "An input is required, please try again.";
"YES" = "Yes";

/* Progress Bar */
"PROGRESS_BAR_STOP_QUESTION" = "Are you sure you want to stop?";
"PROGRESS_BAR_STOP_BUTTON" = "Stop";
